Revit 2027 API
DetailCurveArray.ForwardIterator Method
Retrieve a forward moving iterator to the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual DetailCurveArrayIterator ForwardIterator()
Public Overridable Function ForwardIterator As DetailCurveArrayIterator
public:
virtual DetailCurveArrayIterator^ ForwardIterator()
abstract ForwardIterator : unit -> DetailCurveArrayIterator
override ForwardIterator : unit -> DetailCurveArrayIterator
Return Value
DetailCurveArrayIterator
Returns a forward moving iterator to the array.
See Also
Reference
DetailCurveArray Class
Autodesk.Revit.DB Namespace